In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
np.NaN

nan

In [4]:
np.nan

nan

In [5]:
np.NAN

nan

In [6]:
None

In [8]:
if 1:
    pass

In [9]:
if 1:
    pass
    print(True)
    pass

In [14]:
if 1:
    pass
else:
    print(True)

In [15]:
if 1:
    pass
else:
    pjcbjkkfnxvs

In [16]:
df=pd.DataFrame({'A': [1,2,np.nan],'B': [5, np.nan, np.nan], 'C': [1,2,3] })

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [20]:
df.dropna(how='all')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [22]:
#df.dropna(axis=1, inplace=True)

In [23]:
df.dropna(subset=['A'])

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [24]:
df.dropna(subset=['A','B'])

     A    B  C
0  1.0  5.0  1

In [25]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [26]:
#df.dropna(thresh=2) accept all rows with atleast find 2 non-nan values

In [27]:
df.fillna(value='exe')

     A    B  C
0    1    5  1
1    2  exe  2
2  exe  exe  3

In [28]:
df.fillna(value='exe', limit=1)

     A    B  C
0    1    5  1
1    2  exe  2
2  exe  NaN  3

In [32]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [30]:
df['A'].mean()

1.5

In [33]:
df.A.fillna(value='exe')

0      1
1      2
2    exe
Name: A, dtype: object